"============ Задание 1 ==========="

# a = int(45)
# b = int(6) 
# c = 45/6
# if (c == 7.5):
#     print("Первое число не делится на второе число")
# else:    
#     print(int(c))

"=========== Задание 2 =============="

# chilso1 = int(input("Привет!\nВведите число: "))
# itog1 = int(chilso1/6)
# itog2 = float(chilso1/6)
# if (itog1 == itog2):
#         print( itog1)    
# else : 
#         print('Ваша чисо не делится на "6" '.upper().center(50,'-'))

"=========== Задание 3 =============="

# a1 = int(input('Привет!\nВведите первое число: '))
# a2 = int(input('Введите второе число: '))
# a3 = int(input('Введите третое число: '))
# if (a1 >= 10 and a2 >10 and a3 >= 10):
#     print("yes! правильно!".title().center(30))
# else : print("no!  неправильно!".title())    

"=========== Задание 4 =============="

# a = int(input('Пожалуйста введите одну цифру: '))
# if (0 < a < 5):
#     print(' Верно! '.upper().center(50,'~'))
# else: print(' Неверно! '.center(50,'~').upper())    

"=========== Задание 5 =============="

# a = int(input('Пожалуйста введите первую цифру: '))
# b = int(input('Пожалуйста введите вторую цифру: '))
# if (a <= 1 and b >= 3):
#     print(a + b)
# else: print(a - b)    

"=========== Задание 6 =============="

# a = int(input('Пожалуйста введите первую цифру: '))
# b = int(input('Пожалуйста введите вторую цифру: '))
# if (2 < a < 11 or 6 <= b < 14):
#     print(' Верно !'.upper().center(30,'-'))
# else: print(' Неверно! '.upper().center(30,'-'))    

"=========== Задание 7 =============="

# month = int(input('Пожалуйста введите число от "1" до "12": '))
# """
# zima = int(12) 
# vesna = int(3), (4), (5)
# leto = int(6), (7), (8)
# """
# if (month == 12 or month == 1 or month == 2):
#     print('Это "Зима"!')
# elif (month == 3 or month == 4 or month == 5):
#         print('Это "Весна"!')
# elif (month == 6 or month == 7 or month == 8):
#           print('Это "Лето"!')
# else :     print('Это "Осень"!')
    
"=========== Задание 8 =============="

kv = int(input('Ваша Квартира ? : '))
if (0 < kv < 21) :
    print('Ваша квартира находиися в 1-подъезде')
elif ( 20 < kv < 49):
    print('Ваша квартира находиися в 2-подъезде')
elif (48 < kv < 91):
    print('Ваша квартира находиися в 3-подъезде')
else: 
    print('В этом доме нет такой номер квартиры!'.upper())

